//算術演算子を使った場合の戻り値を出力する
console.log(45 + 18);

//比較演算子を使った場合の戻り値を出力する
console.log(45 > 18);

//等価演算子を使った場合の戻り値を出力する
console.log('5' == 5);

//厳密等価演算子を使った場合の戻り値を出力する
console.log('5' === 5);

//変数numに0~4までのランダムな整数を代入する
let num = Math.floor(Math.random() * 5);

//変数numの値を出力する(確認用)
console.log(num);

//変数numの値が4であれば、「大当たりです」という文字を出力する
if(num === 4){console.log('大当たりです');}

//変数numの値が3であれば、「当たりです」という文字列を出力する
else if(num === 3){console.log('当たりです');}

//それ以外の時は、「ハズレです」という文字列を出力する
else{console.log('ハズレです');}

num = 20;
//&&(かつ)を記述して、すべての条件が成り立つ場合にのみ処理を行う(変数numの値が11~29)
if(num > 10 && num < 30){console.log('変数numの値は10より大きく、30より小さいです');}
else{console.log('条件が成り立ちませんでした');}

num = 30;
//||(または)を記述して、いずれかの条件が成り立つ場合に処理を行う(変数numの値が10または30)
if(num == 10 || num == 30){console.log('変数numの値は10または30です');}
else{console.log('条件が成り立ちませんでした');}
